# ДЗ
# Задача 2: Найдите сумму цифр трехзначного числа.

# *Пример:*

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = int(input())
summa = 0
while a:
    summa += a % 10
    a //= 10
print(summa)


