# list_1 = []
# list_1 = list()
# list_1 = [1, 2, 3, 8]
#
# print(list_1)#  вывод списка в квадратных скобках
# print(*list_1)#  вывод списка без квадратных скобок
# ########################
# list_1 = []
# list_1 = list()
# list_1 = [1, 2, 3, 8]
#
# for i in list_1:
#     print(i) # поочередно выводит значения из списка
# #########################
# list_1 = []
# list_1 = list()
# list_1 = [1, 2, 3, 8]
#
# print(len(list_1)) # выводит колличество элементов с списке
# # ##########################
# list_1 = []
# list_1 = list()
# list_1 = [1, 2, 3, 8]
# print(list_1[2]) # обращение к элементу от начала
##############################
# list_1 = []
# list_1 = list()
# list_1 = [1, 2, 3, 8]
# print(list_1[-1]) # обращение к элементу с конца
##################################
# list_1 = [1, 5]
# print(list_1)
# list_1.append(8) # добавляет элемент в конец списка
# print(list_1)
# ##############################################
# list_1 = []
# for i in range(5):
#     list_1.append(i) # при каждой итерации цикла будет добавляться значение i (от 0 до 4)
#     print(list_1) # для отслеживания итераций
#################################################
# Удаление последнего элемента списка.
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop()) # 0
# print(list_1)# [12, 7, -1, 21]
# print(list_1.pop()) # 21
# print(list_1) # [12, 7, -1]
# print(list_1.pop()) # -1
# print(list_1) # [12, 7]

#################################################
# Удаление конкретного элемента из списка.
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop(0)) # 12
# print(list_1) # [7, -1, 21, 0]
###################################################
# # Добавление элемента на нужную позицию.
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.insert(2, 11))
# print(list_1) # [12, 7, 11, -1, 21, 0]